; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	satellite4 - satellite
	instrument4 - instrument
	satellite5 - satellite
	instrument5 - instrument
	thermograph0 - mode
	image1 - mode
	thermograph2 - mode
	Star3 - direction
	GroundStation5 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star4 - direction
	Planet6 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon13)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon13)
	(supports instrument2 thermograph0)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation5)
	(supports instrument4 image1)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 GroundStation2)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument4 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star12)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 Star4)
	(on_board instrument5 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Phenomenon13)
)
(:goal (and
	(pointing satellite1 Star9)
	(pointing satellite2 Planet6)
	(pointing satellite3 GroundStation2)
	(pointing satellite4 Star12)
	(pointing satellite5 GroundStation2)
	(have_image Planet6 thermograph2)
	(have_image Planet7 thermograph0)
	(have_image Star8 image1)
	(have_image Star9 thermograph2)
	(have_image Star10 image1)
	(have_image Phenomenon11 thermograph2)
	(have_image Star12 thermograph0)
	(have_image Phenomenon13 image1)
))

)

; plan
1. (turn_to satellite3 groundstation2 groundstation5)
   deleted: (pointing satellite3 groundstation5)
   added: (pointing satellite3 groundstation2)
   goals met: 2 of 13
2. (turn_to satellite2 planet6 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 planet6)
   goals met: 3 of 13
3. (turn_to satellite1 star9 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 star9)
   goals met: 4 of 13
4. (turn_to satellite0 groundstation0 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 groundstation0)
   goals met: 4 of 13
5. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 13
6. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 4 of 13
7. (turn_to satellite0 planet6 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet6)
   goals met: 4 of 13
8. (take_image satellite0 planet6 instrument0 thermograph2)
   added: (have_image planet6 thermograph2)
   goals met: 5 of 13
9. (turn_to satellite0 phenomenon13 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon13)
   goals met: 5 of 13
10. (take_image satellite0 phenomenon13 instrument0 image1)
   added: (have_image phenomenon13 image1)
   goals met: 6 of 13
11. (turn_to satellite0 phenomenon11 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon11)
   goals met: 6 of 13
12. (take_image satellite0 phenomenon11 instrument0 thermograph2)
   added: (have_image phenomenon11 thermograph2)
   goals met: 7 of 13
13. (turn_to satellite0 planet7 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet7)
   goals met: 7 of 13
14. (take_image satellite0 planet7 instrument0 thermograph0)
   added: (have_image planet7 thermograph0)
   goals met: 8 of 13
15. (turn_to satellite0 star10 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star10)
   goals met: 8 of 13
16. (take_image satellite0 star10 instrument0 image1)
   added: (have_image star10 image1)
   goals met: 9 of 13
17. (turn_to satellite0 star12 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star12)
   goals met: 9 of 13
18. (take_image satellite0 star12 instrument0 thermograph0)
   added: (have_image star12 thermograph0)
   goals met: 10 of 13
19. (turn_to satellite0 star8 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star8)
   goals met: 10 of 13
20. (take_image satellite0 star8 instrument0 image1)
   added: (have_image star8 image1)
   goals met: 11 of 13
21. (turn_to satellite0 star9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star9)
   goals met: 11 of 13
22. (take_image satellite0 star9 instrument0 thermograph2)
   added: (have_image star9 thermograph2)
   goals met: 12 of 13
23. (turn_to satellite5 groundstation2 phenomenon13)
   deleted: (pointing satellite5 phenomenon13)
   added: (pointing satellite5 groundstation2)
   goals met: 13 of 13
